package chap04;
/*
 * 비트연산자 : &(and), |(or), ^(XOR), ~(not) : 정수값,
 */
public class OpEx07 {
	public static void main(String[] args) {
		System.out.println("6 & 3 ="+(6&3));
		/* 6 : 0110
		   3 : 0011
		  -----------
		   &   0010	 : 2
		*/
		System.out.println("6 | 3 ="+(6|3));
		
		System.out.println("6 ^ 3 ="+(6^3));
		System.out.println("~10 =" + ~10);
		/*
		 * 10 : 00001010
		 * --------------
		 *  ~ : 11110101
		 *  	10001010
		 *  	10001011
		 *  음수는 2의보수로 표현
		 *  2의보수 : 1의보수 + 1
		 *  
		 *  부호 bit가 1이므로 숫자를 2의 보수로 취급함
		 *  
		 *  1110101 : ? 수의 2의보수
		 *  		  1110101의 2의 수가 ? 수임 :
		 *  
		 *  		1110101
		 *  		-------
		 *  1의보수	0001010
		 *  2의보수	0001011
		 */
	}
}
